DROP TABLE IF EXISTS films;

CREATE TABLE films (
    id INT AUTO_INCREMENT PRIMARY KEY,
    title VARCHAR(255) NOT NULL,
    director VARCHAR(255),
    release_date DATE,
    duration TIME,
    genre SET('драма', 'комедия', 'боевик', 'фантастика', 'триллер', 'ужасы', 'мелодрама', 'приключения', 'детектив', 'мультфильм', 'криминал', 'фэнтези', 'военный', 'биография', 'спорт'),
    country VARCHAR(100),
    min_age TINYINT UNSIGNED CHECK (min_age IN (0, 6, 12, 16, 18)),
    rating DECIMAL(3,1) CHECK (rating BETWEEN 0 AND 10)
);

INSERT INTO films (title, director, release_date, duration, genre, country, min_age, rating) VALUES
('Операция «Ы» и другие приключения Шурика', 'Леонид Гайдай', '1965-08-23', '01:35:00', 'комедия', 'СССР', 6, 8.7),
('Бриллиантовая рука', 'Леонид Гайдай', '1969-04-28', '01:40:00', 'комедия,криминал', 'СССР', 6, 8.5),
('Мистер и миссис Смит', 'Даг Лайман', '2005-06-10', '02:00:00', 'боевик,комедия', 'США', 16, 7.0),
('Титаник', 'Джеймс Кэмерон', '1997-12-19', '03:14:00', 'драма,мелодрама', 'США', 12, 8.4),
('Аватар', 'Джеймс Кэмерон', '2009-12-18', '02:42:00', 'боевик,фантастика,приключения', 'США', 12, 8.0),
('Терминатор 2: Судный день', 'Джеймс Кэмерон', '1991-07-03', '02:17:00', 'боевик,фантастика,триллер', 'США', 16, 8.6),
('Матрица', 'Лана и Лилли Вачовски', '1999-03-31', '02:16:00', 'боевик,фантастика', 'США', 16, 8.7),
('Форрест Гамп', 'Роберт Земекис', '1994-07-06', '02:22:00', 'драма,комедия,мелодрама', 'США', 12, 8.9),
('Один дома', 'Крис Коламбус', '1990-11-16', '01:43:00', 'комедия', 'США', 6, 8.2),
('Гарри Поттер и философский камень', 'Крис Коламбус', '2001-11-16', '02:32:00', 'приключения,фэнтези', 'Великобритания', 12, 8.2),
('Властелин колец: Братство кольца', 'Питер Джексон', '2001-12-19', '02:58:00', 'драма,приключения,фэнтези', 'США', 12, 8.8),
('Пираты Карибского моря: Проклятие Чёрной жемчужины', 'Гор Вербински', '2003-07-09', '02:23:00', 'боевик,приключения,фэнтези', 'США', 12, 8.3),
('Шрек', 'Эндрю Адамсон, Вики Дженсон', '2001-05-18', '01:30:00', 'комедия,мультфильм,фэнтези', 'США', 6, 8.0),
('Интерстеллар', 'Кристофер Нолан', '2014-11-07', '02:49:00', 'драма,фантастика,приключения', 'США', 12, 9.0);